package com.example.p_abstraction;

public class Dog extends Animal {
    @Override
    public String species() {
        return "Dog";
    }
    @Override
    public void sound() {
        System.out.println("The dog barks.");
    }
}

/*
    Абстракція допомагає приховати деталі роботи програми,
    щоб інші частини програми могли користуватися лише важливими
    властивостями. У цьому коді абстракція дозволяє нам створити
    загальний клас Animal, який містить методи, що характеризують
    усіх тварин. Клас Dog розширює клас Animal і надає конкретну
    реалізацію для методів species() і sound(), специфічну для собаки.
    Під час виконання програми об'єкт класу Dog створюється, і
    через виклик методів species() і sound() ми отримуємо відповідні
    результати для собаки.
*/